# CreateMultipleConnections Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalConnection..::..CreateMultipleConnections Method
MEPAnalyticalConnection Class See Also
---
Creates new analytical connections between the equipment connector and the nearest point on the curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static ISet<ElementId> CreateMultipleConnections(
	Document doc,
	ElementId typeId,
	IList<Connector> equipmentOpenConnectors,
	IList<ElementId> curveIdsToConnect
)
```

Visual Basic
---
```text
Public Shared Function CreateMultipleConnections ( _
	doc As Document, _
	typeId As ElementId, _
	equipmentOpenConnectors As IList(Of Connector), _
	curveIdsToConnect As IList(Of ElementId) _
) As ISet(Of ElementId)
```

Visual C++
---
```text
public:
static ISet<ElementId^>^ CreateMultipleConnections(
	Document^ doc,
	ElementId^ typeId,
	IList<Connector^>^ equipmentOpenConnectors,
	IList<ElementId^>^ curveIdsToConnect
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document where the new elements are created.
typeId
    Type: Autodesk.Revit.DB..::..ElementId The type of new analytical connections.
equipmentOpenConnectors
    Type: System.Collections.Generic..::..IList<(Of <(<'Connector>)>)> The open equipment connectors to be analytically connected.
curveIdsToConnect
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> The curves which the equipment is connected to.
# ### Return Value
The new analytical connection elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Invalid connection type. -or- Not all connectors support the analytical connection. -or- No connector included. -or- Not all elements are valid curve ids. -or- No curve included. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MEPAnalyticalConnection Class
Autodesk.Revit.DB Namespace